Revit 2024 API
BuiltInFailures.MEPCalculationFailures.Network_OverConstrained Property
 The calculation could not be executed as configured. The Pressure and Flow Rate combined constraint requires at least 2 other pressure or flow constraints. Specify additional constraints.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId Network_OverConstrained { get; }
Visual Basic
Public Shared ReadOnly Property Network_OverConstrained As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ Network_OverConstrained {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace